In [51]:
import pandas as pd
import numpy as np

In [52]:
doc_path = './data_sources/bestsellers-with-categories_e591527f-ae45-4fa5-b0d1-d50142128fa6.csv'
df_books = pd.read_csv(doc_path)

# Agregar y eliminar datos
Esta funcionalidad aplica tanto a nivel de filas como a nivel de columnas.

In [53]:
# Visualizar datos
df_books.head(3) # Con head() le indicamos que nos regrese que los primer valores hasta el índice especificado del dataframe

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction

## Columnas

Existen varios metodos para eliminar y para agregar datos a nivel de columnas.

### Eliminar

La función `drop` de pandas nos permite quitar la o las  columnas especificadas.
<br>

`drop` recibe un parametro booleano llamado `inplace`, en el indicamos si queremos que el dato se elimine de la tabla o solo de la salida, por default esta en `False`.
<br>

Otro parámetro es el de `axis` en el cual le indicamos sobre que eje eliminar los datos, donde
- `axis = 0`: Filas
- `axis = 1`: Columnas

Sin eliminarlo del dataframe

In [54]:
df_books.drop('Genre', axis=1).head(3)

,Name,Author,User Rating,Reviews,Price,Year
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018

En el resultado de arriba ya no se observa la columna "Genre", pero si consultamos de nuevo la columna reaparecera.

In [55]:
df_books.head(3)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction

Para eliminarla definitivamente del `DataFrame` lo podemos hacer de 3 formas, ya última es la menos recomendada.

1. Enviar el valor `True` al parámetro `inplace`

In [56]:
df_books.drop('Genre', axis=1, inplace=True)
df_books.head(3)

,Name,Author,User Rating,Reviews,Price,Year
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018

2. Reasignar el la vaiable `df_books` con el resultado de `drop`

In [57]:
df_books = df_books.drop('Year', axis=1)
df_books.head(3)

,Name,Author,User Rating,Reviews,Price
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8
1,11/22/63: A Novel,Stephen King,4.6,2052,22
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15

3. Usando el comando `del` nativo de Python

In [58]:
del df_books['Price']
df_books.head(3)

,Name,Author,User Rating,Reviews
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350
1,11/22/63: A Novel,Stephen King,4.6,2052
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979

### Agregar

Agregar columnas nuevas a un `DataFrame` es verdaderamente sencillo, solo necesitamos especifica el nombre de la columna entre corchetes y asignarle un valor.

In [59]:
df_books['Nueva_columna'] = np.nan
df_books.head(3)

,Name,Author,User Rating,Reviews,Nueva_columna
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,NaN
1,11/22/63: A Novel,Stephen King,4.6,2052,NaN
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,NaN

Otra forma de hacerlo es asignandole un array (estructura vectorial) a la nueva columna.
<br>

Con este metodo hay una restricción, y es que el número de rows del array debe ser igual al número de rows del dataframe.

Obtenemos el número de filas del `DataFrame`

In [60]:
df_books.shape[0]

550

A partir de ese número de rows generaremos un array para asignarlo a otra columna nueva.

In [61]:
arr = np.arange(0, df_books.shape[0])

Creamos la columna y le asignamos la datad del array

In [62]:
df_books['Rango'] = arr
df_books.head(3)

,Name,Author,User Rating,Reviews,Nueva_columna,Rango
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,NaN,0
1,11/22/63: A Novel,Stephen King,4.6,2052,NaN,1
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,NaN,2

---

## Filas

### Eliminar

Para eliminar filas también utilizamos la función `drop` con la diferencia de que en el parámetro `axis` mandamos el valor `1` indicando que eliminaremos filas.

In [63]:
df_books.drop(0, axis=0).head(3)

,Name,Author,User Rating,Reviews,Nueva_columna,Rango
1,11/22/63: A Novel,Stephen King,4.6,2052,NaN,1
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,NaN,2
3,1984 (Signet Classics),George Orwell,4.7,21424,NaN,3

Al no mandarle `inplace` en `True` drop solo quitó la fila `0` de la salida no del `DataFrame`

In [64]:
df_books.head(3)

,Name,Author,User Rating,Reviews,Nueva_columna,Rango
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,NaN,0
1,11/22/63: A Novel,Stephen King,4.6,2052,NaN,1
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,NaN,2

In [65]:
df_books.drop(0, axis=0, inplace=True)
df_books.head(3)

,Name,Author,User Rating,Reviews,Nueva_columna,Rango
1,11/22/63: A Novel,Stephen King,4.6,2052,NaN,1
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,NaN,2
3,1984 (Signet Classics),George Orwell,4.7,21424,NaN,3

También podemos eliminar más de una fila a la vez

In [67]:
df_books.drop([1, 2, 3], axis=0).head(3) # un array de indices por fila

,Name,Author,User Rating,Reviews,Nueva_columna,Rango
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,NaN,4
5,A Dance with Dragons (A Song of Ice and Fire),George R. R. Martin,4.4,12643,NaN,5
6,A Game of Thrones / A Clash of Kings / A Storm...,George R. R. Martin,4.7,19735,NaN,6

In [68]:
df_books.drop(range(1, 20), axis=0).head(3) # Rango de inidices

,Name,Author,User Rating,Reviews,Nueva_columna,Rango
20,All the Light We Cannot See,Anthony Doerr,4.6,36348,NaN,20
21,All the Light We Cannot See,Anthony Doerr,4.6,36348,NaN,21
22,Allegiant,Veronica Roth,3.9,6310,NaN,22

### Agregar

La forma más sencilla y eficiente de agregar rows a un `DataFrame` es con la función `append`, sin embargo esta función ya se encuentra descontinuada, para sustituirla utilizaremos la función `concat`

In [75]:
# Agregar el DataFrames a si mismo
df_books = pd.concat([df_books, df_books])
df_books

,Name,Author,User Rating,Reviews,Nueva_columna,Rango
1,11/22/63: A Novel,Stephen King,4.6,2052,NaN,1
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,NaN,2
3,1984 (Signet Classics),George Orwell,4.7,21424,NaN,3
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,NaN,4
5,A Dance with Dragons (A Song of Ice and Fire),George R. R. Martin,4.4,12643,NaN,5
...,...,...,...,...,...,...
545,Wrecking Ball (Diary of a Wimpy Kid Book 14),Jeff Kinney,4.9,9413,NaN,545
546,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,NaN,546
547,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,NaN,547
548,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,NaN,548
549,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,NaN,549

[Documentación de drop](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop.html)
<br>

[Documentación de concat](https://pandas.pydata.org/docs/reference/api/pandas.concat.html#pandas.concat)